# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here

import pandas as pd
import numpy as np

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

file = pd.read_csv('Temp_States.csv')

temp = pd.DataFrame(file)

#### Print `temp`.

In [3]:
# your code here

temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here

Not too much to comment.
"""

'\nyour comments here\n\nNot too much to comment.\n'

#### Select the rows where state is New York.

In [6]:
# your code here

temp[temp.State == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
# your code here

temp[temp.State == 'New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here

temp[temp.Temperature > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here
# your code here

temp.City[temp.Temperature > 15]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code here

temp.City[(temp.Temperature > 15) & (temp.Temperature < 20)]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
# your code here

print (temp.groupby(by='State'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002083592EA00>

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
# your code here

file = pd.read_csv('Employee.csv')

employees = pd.DataFrame(file)

#### Explore the data types of the `employees` dataframe. Comment your results.

In [50]:
# your code here

employees.sort_values(by = 'Years')

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
5     Eva      Sales  Bachelor      F  associate      2      55
4  Samuel      Sales    Master      M  associate      3      55
3   Sonia         HR  Bachelor      F    analyst      4      35
7   Pedro         IT       Phd      M  associate      7      60
6  Carlos         IT    Master      M         VP      8      70
8     Ana         HR    Master      F         VP      8      70

In [14]:
"""
your comments here


Salaries are more related with your title than with your experience in the company.


"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [51]:
# your code here

employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### What's the highest salary?

In [63]:
# your code here

employees.Salary.max()

70

#### What's the lowest salary?

In [64]:
# your code here

employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [67]:
# your code here

employees [employees.Salary == employees.Salary.min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [69]:
# your code here

employees[employees.Name== 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [70]:
# your code here

employees.Salary[employees.Name== 'David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [71]:
# your code here

employees[employees.Title== 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [73]:
# Method 1
# your code here

employees[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [83]:
# Method 2
# your code here

employees.loc[0:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [84]:
# your code here

employees[employees.Salary > 65]

     Name Department Education Gender Title  Years  Salary
6  Carlos         IT    Master      M    VP      8      70
8     Ana         HR    Master      F    VP      8      70

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [87]:
# your code here

employees.groupby(by='Years').mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [88]:
# your code here

employees.groupby(by='Title').mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [91]:
# your code here

employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Is the mean salary different per gender?

In [93]:
# your code here

employees.groupby(by='Gender').mean()

#Surprise, surprise, yep, men salary is higher.

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [95]:
# your code here

employees.groupby(by='Department').describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [102]:
# your code here

employees.groupby(by='Department').agg(['max', 'min'])

              Name         Education           Gender          Title  \
               max     min       max       min    max min        max
Department
HR           Sonia     Ana    Master  Bachelor      M   F    analyst
IT           Pedro  Carlos       Phd  Bachelor      M   F  associate
Sales       Samuel     Eva    Master  Bachelor      M   F  associate

                      Years     Salary
                  min   max min    max min
Department
HR                 VP     8   2     70  30
IT                 VP     8   1     70  30
Sales       associate     3   2     55  55

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [103]:
# your code here

file = pd.read_csv('Orders.csv')

orders = pd.DataFrame(file)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [107]:
# your code here

orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [105]:
"""
your comments here
"""

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

####  What is the average purchase price?

In [112]:
# your code here

orders.UnitPrice.mean()

3.1161744805540756

#### What are the highest and lowest purchase prices?

In [113]:
# your code here

print (orders.UnitPrice.max())
print (orders.UnitPrice.min())

8142.75
0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [115]:
# your code here

orders.CustomerID[orders.Country == 'Spain']

4250      12557
4251      12557
4252      12557
4253      12557
4254      12557
          ...
394733    17097
394734    17097
394735    17097
394736    17097
394737    17097
Name: CustomerID, Length: 2485, dtype: int64

#### How many customers do we have in Spain?

In [116]:
# your code here

len(orders.CustomerID[orders.Country == 'Spain'])

2485

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [38]:
# your code here

Quantity   CustomerID

orders

#### Select orders from Spain that include more than 50 items.

In [39]:
# your code here

#### Select all free orders.

In [40]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [41]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [42]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [43]:
# your code here

#### Select all orders made in the month of August.

In [44]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [45]:
# your code here

#### What's the  average amount of money spent by country?

In [46]:
# your code here

#### What's the most expensive item?

In [47]:
# your code here

#### What is the average amount spent per year?

In [48]:
# your code here